IdeaRS.OpenModel.Parameters.WeldType
Represents the code of the position

IdeaRS.OpenModel.Parameters.WeldType.None
No weld

IdeaRS.OpenModel.Parameters.WeldType.LeftFillet
Fillet weld is on the left side

IdeaRS.OpenModel.Parameters.WeldType.RightFillet
Fillet weld on the right side

IdeaRS.OpenModel.Parameters.WeldType.DoubleFillet
Fillet weld on both sides (double fillet)

IdeaRS.OpenModel.Parameters.WeldType.Bevel
Bevel weld